
//ԽՆԴԻՐ։ տպել 20-ից 200 միջակայքում գտնվող բոլոր կենտ թվերը
//տ1․ գեներացնել բոլորը, բայց ընտել միայն կենտերը
/*
for(var i = 20; i<=200; i++){
    if(i%2==1){
        console.log(i);
    }
}

console.log("----------------");

//տ2․ գեներացնել միայն կենտերը
for(var i = 21; i<=200; i+=2){
    console.log(i);
}
*/
/*
//տ1․ գեներացնել բոլորը, բայց ընտել միայն 7-ի բաժանվողները
var mult = 1;
for(var i=7; i<300; i++){
    if(i%7==0){
        mult*=i;
        console.log(i,mult);
    }
}
console.log(mult);
console.log("---------------------------");


//տ2․ գեներացնել միայն 7-ի բաժանվողները
var mult = 1;
for(var i=7; i<300; i+=7){
  mult*=i;
}
console.log(mult);
*/
var j = 5;
while(j<1000)
{
    if(j%3!=0 && j%7!=0){
        console.log(j);
    }
    j+=1;
}

//5,8,10,11,13,16,17,19,20
